In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [6]:
%%sql
create database if not exists tutorial;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[]

In [7]:
%%sql
use tutorial

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [10]:
%%sql
drop table if exists employees;
CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    email VARCHAR(100),
    hire_date DATE,
    job_title VARCHAR(50),
    salary DECIMAL(10, 2)
);

INSERT INTO employees (employee_id, first_name, last_name, email, hire_date, job_title, salary)
VALUES
(1, 'John', 'Doe', 'john.doe@example.com', '2022-05-01', 'Software Engineer', 85000.00),
(2, 'Jane', 'Smith', 'jane.smith@example.com', '2023-03-15', 'Data Scientist', 92000.00),
(3, 'Alice', 'Johnson', 'alice.johnson@example.com', '2024-05-01', 'Engineer', 95000.00),
(4, 'Mark', 'Taylor', 'mark.taylor@example.com', '2022-11-15', 'Manager', 100000.00),
(5, 'Gowtham', 'sb', 'gowtham.sb@example.com', '2022-11-15', 'Data Engineer', 100000.00),
(6, 'Peter', 'sb', 'peter.sb@example.com', '2022-11-15', 'Data Engineer', 120000.00);

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.
6 rows affected.

[]

In [12]:
%%sql
select employee_id,first_name,last_name,salary
from employees
where salary > 90000;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(2, 'Jane', 'Smith', Decimal('92000.00')),
 (3, 'Alice', 'Johnson', Decimal('95000.00')),
 (4, 'Mark', 'Taylor', Decimal('100000.00')),
 (5, 'Gowtham', 'sb', Decimal('100000.00')),
 (6, 'Peter', 'sb', Decimal('120000.00'))]

In [13]:
%%sql
create view high_earners as
select employee_id,first_name,last_name,salary
from employees
where salary > 90000;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [16]:
%%sql
select * from high_earners

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(2, 'Jane', 'Smith', Decimal('92000.00')),
 (3, 'Alice', 'Johnson', Decimal('95000.00')),
 (4, 'Mark', 'Taylor', Decimal('100000.00')),
 (5, 'Gowtham', 'sb', Decimal('100000.00')),
 (6, 'Peter', 'sb', Decimal('120000.00'))]

View and the table referenced are logically connected,the updates to the orginal table is reflected in the view as well

In [20]:
%%sql
INSERT INTO employees (employee_id, first_name, last_name, email, hire_date, job_title, salary)
VALUES
(9, 'John', 'Doe', 'john.doe@example.com', '2022-05-01', 'Software Engineer', 95000.00);

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[]

In [21]:
%%sql
select * from high_earners

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[(2, 'Jane', 'Smith', Decimal('92000.00')),
 (3, 'Alice', 'Johnson', Decimal('95000.00')),
 (4, 'Mark', 'Taylor', Decimal('100000.00')),
 (5, 'Gowtham', 'sb', Decimal('100000.00')),
 (6, 'Peter', 'sb', Decimal('120000.00')),
 (9, 'John', 'Doe', Decimal('95000.00'))]

In [22]:
%%sql
create view all_employees as
select * from employees;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [23]:
%%sql
select * from all_employees

 * mysql+mysqlconnector://root:***@localhost
9 rows affected.

[(1, 'John', 'Doe', 'john.doe@example.com', datetime.date(2022, 5, 1), 'Software Engineer', Decimal('85000.00')),
 (2, 'Jane', 'Smith', 'jane.smith@example.com', datetime.date(2023, 3, 15), 'Data Scientist', Decimal('92000.00')),
 (3, 'Alice', 'Johnson', 'alice.johnson@example.com', datetime.date(2024, 5, 1), 'Engineer', Decimal('95000.00')),
 (4, 'Mark', 'Taylor', 'mark.taylor@example.com', datetime.date(2022, 11, 15), 'Manager', Decimal('100000.00')),
 (5, 'Gowtham', 'sb', 'gowtham.sb@example.com', datetime.date(2022, 11, 15), 'Data Engineer', Decimal('100000.00')),
 (6, 'Peter', 'sb', 'peter.sb@example.com', datetime.date(2022, 11, 15), 'Data Engineer', Decimal('120000.00')),
 (7, 'John', 'Doe', 'john.doe@example.com', datetime.date(2022, 5, 1), 'Software Engineer', Decimal('85000.00')),
 (8, 'John', 'Doe', 'john.doe@example.com', datetime.date(2022, 5, 1), 'Software Engineer', Decimal('90000.00')),
 (9, 'John', 'Doe', 'john.doe@example.com', datetime.date(2022, 5, 1), 'Software Engineer', Decimal('95000.00'))]